import Image from 'next/image'

export default function Home() {
  return (
    <main className="container">
      <p>گنجشک خانگی یا گنجشک معمولی یا گنجشک شهری (نام علمی: Passer domesticus) گونه‌ای گنجشک است که عمدتاً در مناطق شهری و در تعداد بسیار زندگی می‌کند. گنجشک خانگی از آشناترین حیوانات وحشی برای انسان است. زیست‌گاه بومی این پرنده اروپا، سواحل مدیترانه و بیشتر نقاط آسیا است، اما در پی فعالیت‌های انسانی وارد بیشتر نواحی قاره آمریکا، آفریقای جنوب صحرا، نیوزیلند و استرالیا و مناطق شهری در نقاط دیگر دنیا شده‌است. گنجشک خانگی در حال حاضر وسیع‌ترین پراکندگی را در میان تمامی پرندگان وحشی کره زمین دارد. این پرنده در ارتباط تنگاتنگ با سکونت‌گاه‌های انسانی است اما تنها گونهٔ گنجشک نیست که در نزدیکی خانه‌ها زندگی می‌کند.
        گنجشک‌های خانگی در زیستگاه‌ها و اقلیم‌های بسیار متنوعی دیده می‌شوند اما معمولاً بیشتر در نزدیکی سکونتگاه‌های انسانی زندگی کرده و از جنگل‌های انبوه، علفزارها و بیابان‌ها دوری می‌کنند. غذای اصلی این پرنده دانه‌ها و تخم علف‌ها است. البته گنجشک خانگی حیوانی فرصت‌طلب است و از حشرات و بسیاری از غذاهای دیگر هم تغذیه می‌کند. گربه‌ها، قوشها، جغدها، زاغی‌ها و کلاغها و بسیاری از پرندگان شکاری و پستانداران شکارچی دیگر از دشمنان طبیعی این پرنده کوچک به شمار می‌روند.
        گنجشک‌های خانگی پرندگان بسیار اجتماعی هستند و در تمام فصول سال معمولاً به‌صورت گروهی به جستجو و خوردن غذا مشغول می‌شوند. همچنین این پرندگان معمولاً به‌صورت گروهی و در نزدیکی یکدیگر لانه‌سازی می‌کنند و درگیر فعالیت‌های اجتماعی مانند بازی در گردخاک و یا حمام آب و آواز می‌شوند. گنجشک‌های خانگی به‌صورت گله‌ای بر روی شاخه های درختان می‌نشینند و برای تغذیه به پایین می‌آیند. گنجشک خانگی ماده باوجود جثه کوچکش بر گنجشک نر برتری دارد.</p>
    </main>
  )
}
